
from pyrogram import Client, filters
import requests
import random
import os
import re
import asyncio
import time
from DAXXMUSIC import app

from pyrogram.types import Message, InlineKeyboardMarkup, InlineKeyboardButton

SHAYRI = [ " 🌺**از شکنجه کردنت و بعد دلداری دادنت با عشق خیلی حس خوبیه ",
            "🌺**زندگی من زندگی من، تو نام دوم آرامش منی.**🌺 \n\n**🥀زندگی عشق جان زندگی من است، تو نام دوم آرامش منی.🥀**",
            "🌺**دستت را بر دلم بگذار و دلت را به نام من بساز.**🌺\n\n**🥀دستت را بر قلبم بگذار و دلت را به نام من بساز.🥀**",
            "🌺**مهادف نه ماشینی لازم است و نه خانه ییلاقی، عشقم محفوظ است، فقط این دعا لازم است. **🌺 \n\n**🥀مهادف، نه ماشینی لازم است و نه خانه ای، عشق من می ماند. اینجا فقط به این نعمت ها نیاز است.🥀* * ",
            "🌺**گوش کن عزیزم، تو فقط مواظب آشپزخانه هستی، من آنجا هستم تا از تو مراقبت کنم.**🌺 \n\n**🥀گوش کن عزیزم، تو فقط مراقب آشپزخانه باش، من اینجا هستم تا از تو مراقبت کنم. مراقب تو باشم.🥀** ",
            "🌺**یک چیز از صد، من فقط شرکت شما را می خواهم.**🌺 \n\n**🥀پس یک چیز از صد، من فقط شرکت شما را می خواهم.🥀** ",
            "🌺 **تو را با سختی های فراوان یافته ام، حالا نمی خواهم تو را از دست بدهم، که مال تو بودم، حالا نمی خواهم مال دیگری باشم. **🌺 \n\n** 🥀من تو را با سختی های زیادی پیدا کردم، حالا نمی خواهم تو را از دست بدهم، آنها مال تو هستند و نمی خواهم با هیچ کس دیگری باشم.🥀**",
            "🌺**عزیزم، ما هر روز حرف میزنیم، بیا امروز عاشقانه بکنیم.**🌺\n\n**🥀عزیزم، بیا هر روز حرف بزنیم، امروز عاشقانه انجام دهیم..🥀**",
            "🌺 **تو کلید قفل دلم هستی چی بگم عزیزم تو تنها دلیل زندگی منی **🌺 \n\n**🥀تو کلید قفل منی عزیزم چی بهت بگم تو تنها چهره زندگی منی..🥀**",
            "🌺**ما همه چیز تو را دوست خواهیم داشت، به همه چیز تو اعتماد خواهیم کرد، فقط یکبار بگو که تو فقط مال منی، ما تمام عمر منتظرت خواهیم بود.**🌺 \n\n**🥀 ما همه را دوست خواهیم داشت مال تو، ما به هر چیز تو احترام می گذاریم، فقط یک بار بگو که تو فقط مال منی، تا آخر عمر منتظرت می مانیم..🥀**",
            "🌺**عشق هرگز با افراد خاص اتفاق نمی افتد، هر که عاشق شود خاص می شود.**🌺 \n\n**🥀عشق هرگز با افراد خاص اتفاق نمی افتد، هر که عاشق شود خاص می شود.",
            "🌺**تو جان منی، شکی در آن نیست، هیچکس جز تو حقی بر من ندارد.**🌺 \n\n** جز تو حقی بر من داری...🥀**",
            " 🌺 **ما نتوانستیم عشق اولم را بشناسیم، نمی توانستیم تشخیص دهیم عشق چیست، آنقدر آن را در قلب خود نگه داشتیم که هر وقت خواستیم نتوانستیم آن را از قلبمان حذف کنیم. **🌺 \n\n **🥀 عشق اول من، چه عشقی است بی آنکه بدانم، آنقدر آن را در دلم نگه داشتیم که هر وقت خواستم نتوانم آن را از قلبم بیرون کنم.🥀** ",
            " 🌺 ** من خودم نمی دانم چقدر عزیز است، او برای من عزیز است، اما فاصله مهم نیست، او مال دیروز ما بود و حتی امروز مال ماست. **🌺 \n\n**🥀 من حتی نمیدانم چقدر برای من عزیز است، او از جان من برای من عزیزتر است، فرقی نمیکند مال دیروز ما بود یا امروز.",
           " 🌺 ** یواشکی می آیی و وارد این دل می شوی، در نفسم عطر من می شوی، این گونه می پرانی، جادوی عشقت این گونه عمل کرده است، تنها تو هستی که در خواب و بیداری می بینم. * 🌺 \n\n* *🥀 تو بی صدا به این شکل وارد قلبم می شوی، همان طور که عطر من لبه ها را پر می کند، جادوی عشقم را پخش می کنی، در خواب به من نگاه می کنی..🥀**",
            " نفرت، فقط تو هستی، هیچ کس دیگری در قلب من نیست.🥀** ",
            " خوشبختی شما را از خدا میخواهم، دعای خیرتان را میخواهم، در عجبم که چه میخواهید، عشق زندگیتان را میخواهم...🥀** ",
            " وقتی به صورتت نگاه می کنم، می بینم که رابطه ما چگونه است.با این دل داغ دلهای ما هم متحد می شود.🥀** ",
            " 🌺**بگذار امروز این را به تو بگویم، اجازه بده امروز عصر را تزیین کنم، مرا اسیر عشق خودت کن، بگذار امروز جانم را فدای تو کنم.**🌺\n\n** 🥀لطفاً به من اجازه بده. امروز این را به تو بگو، اجازه بده امروز این شرم را با تو در میان بگذارم، لطفاً اجازه بده تا زندگی ام را در عشق تو به تو برگردانم..🥀** ",
            "🌺**بدانید که مردم چه اسم هایی برای عشق می گذارند، ما نام شما را عشق می نامیم.**🌺\n\n**🥀مردم جین می دانند که ما به چه نام هایی عشق می گوییم، ما نام شما را عشق می نامیم. من می گویم.. .🥀** ",
            "🌺**وقتی ما را می بینند سرشان را خم می کنند. در جمع ما را صدا می زنند و نگاه می کنند. بدشان می آید مهم نیست. اما چرا با ملاقات با غریبه ها دل ما را می سوزانید.**🌺\n\ n**🥀دخ ",
           " 🌺 **بی تو از هم می پاشم، اگر تو را ملاقات کنم مثل گل شکوفه می دهم، اگر تو را پیدا نکنم زنده می میرم، اگر تو را پیدا کنم پس از مردن هم زنده خواهم ماند. **🌺\n",
            " 🌺**صنم به تو سوگند همان طور که من برای خوشبختی تو لازمم تو لازمه زندگی من. **🌺\n\n** تو در زندگی من ضروری هستی..🥀** ",
            "🌺**عاشق خشم تو شده ام. کسی در این دنیای بی رحم هست که مرا به حق کامل تهدید کرده است.**🌺\n\n**🥀من عاشق خشم کوچک تو شده ام. مرا به حقیقت محض تهدید کرد.🥀** ",
            "🌺**چشم را مژه حفظ می کند، تپش قلب امانت دل است، این رابطه هم بسیار شیرین است، گاهی میل دارد و گاهی شکایت.**🌺\n\n**🥀چشم را مژه حفظ می کند. , تپش قلب .در دل اعتماد هست، این رابطه هم خیلی شیرین است، گاهی دوست داشتنی و گاهی آموزش داده می شود.🥀** ",
            "🌺**وقتی مردم عشق را خدا می دانند پس چرا کسی را که دوست دارد بد می دانند. وقتی خود دنیا قلب سنگی است پس چرا مردم به سنگ دعا می کنند.**🌺\n\n**🥀 محبت کو حب لوگ خدا حواسش هست چرا حواسش به اوناییه که دوستش دارن وقتی دنیا قلب سنگی داره پس چرا مردم از سنگ دعا میکنن.🥀**",
           "🌺**مردم اینجا با چند چهره زندگی می کنند، ما فقط یک چهره را دوست داریم، این چهره را پنهان نکنید، زیرا ما فقط پس از دیدن آن زندگی می کنیم.**🌺\n\n**🥀 مردم اینجا چند چهره زندگی می کنند؟ ما فقط چهره ها را دوست داریم و آنها را نمی بوسیم زیرا با نگاه کردن به آنها زندگی می کنیم.🥀** " ]
# Command
SHAYRI_COMMAND = ["gf", "bf", "/love", "لاو", "عاشقانه", "love"]

@app.on_message(
    filters.command(SHAYRI_COMMAND)
    & filters.group
    )
async def help(client: Client, message: Message):
    await message.reply_text(
        text = random.choice(SHAYRI),
        reply_markup=InlineKeyboardMarkup(
            [
                [
                    InlineKeyboardButton(
                        "✨گروه پشتیبانی✨", url=f"https://t.me/+_0XRE7EVJPFkN2I0")
                    
                ]
            ]
        ),
    )

@app.on_message(
    filters.command(SHAYRI_COMMAND)
    & filters.private
    )
async def help(client: Client, message: Message):
    await message.reply_text(
        text = random.choice(SHAYRI),
        reply_markup=InlineKeyboardMarkup(
            [
                [
                    InlineKeyboardButton(
                        "✨گروه پشتیبانی✨", url=f"https://t.me/+_0XRE7EVJPFkN2I0")
                    
                ]
            ]
        ),
    )
