# کلاس Helper که بخش‌های مرتبط با دکمه‌ها و پیام‌های نمایشی ربات را در اینجا ترجمه کرده است

class Helper(object):
    HELP_M = '''کتگوری مورد نظرتان را برای دریافت راهنما انتخاب کنید.
سوالات خود را در گفتگوی پشتیبانی مطرح کنید

تمام دستورات با `/` قابل استفاده هستند:'''
    HELP_ChatGPT = '''ChatGPT

دستورات ChatGPT:

/ask ➠ سوالات را از مدل هوش مصنوعی بپرسید تا پاسخی به سوال شما بدهد.
'''

    HELP_Sticker = '''برچسب‌ها

دستورات برچسب‌ها:

/packkang ➠ یک بسته از برچسب‌ها از بسته دیگری ایجاد می‌کند.
/stickerid ➠ شناسه برچسب را برای یک برچسب دریافت می‌کند.
'''

    HELP_TagAll = '''برچسب

  دستورات برچسب:

✿ برچسب مورد نظر خود را در گفتگوی خود انتخاب کنید ✿

๏ /tagall ➛ برچسب پیام‌ها با تگ تصادفی متوقف می‌شود ⇴ /tagoff /tagstop

๏ /vctag ➛ دعوت به گپ صوتی با تگ توقف ⇴ /vcstop
'''

    HELP_Info = '''اطلاعات

دستورات اطلاعات:

/id : شناسه گروه فعلی را دریافت می‌کند. اگر با پاسخ به یک پیام استفاده شود، شناسه کاربر را دریافت می‌کند.
/info : اطلاعات درباره یک کاربر را دریافت می‌کند.
/github <نام‌کاربری> : اطلاعات درباره یک کاربر گیت‌هاب را دریافت می‌کند.
'''
    HELP_Group = '''گروه

دستورات گروه:

این دستورات مدیریت گروه در دسترس است:

⦿ /pin ➠ یک پیام را در گروه پین می‌کند.
⦿ /pinned ➠ پیام پین شده را در گروه نمایش می‌دهد.
⦿ /unpin ➠ پیام فعالاً پین شده را لغو می‌کند.
⦿ /staff ➠ لیست اعضای کادر مدیریتی را نمایش می‌دهد.
⦿ /bots ➠ لیست ربات‌ها در گروه را نمایش می‌دهد.
⦿ /settitle ➠ عنوان گروه را تنظیم می‌کند.
⦿ /setdiscription ➠ توضیحات گروه را تنظیم می‌کند.
⦿ /setphoto ➠ تصویر گروه را تنظیم می‌کند.
⦿ /removephoto ➠ تصویر گروه را حذف می‌کند.
⦿ /zombies ➠ حساب‌های کاربری حذف شده را از گروه حذف می‌کند.
⦿ /imposter روشن/خاموش ➠ نمایش یا عدم نمایش تغییرات در نام یا عکس پروفایل گروه توسط اعضا.
'''

    HELP_Extra = '''قابلیت ها

دستورات اضافی:

⦿ /math ➠ حل مسائل ریاضی و معادلات.
⦿ /blackpink ➠ ساخت لوگو به سبک Blackpink.
⦿ /carbon ➠ ساخت تصویر کد Carbon از یک قطعه کد.
⦿ /speedtest ➠ اندازه‌گیری سرعت اینترنت.
⦿ /reverse ➠ برعکس کردن یک متن داده شده.
⦿ /webss ➠ گرفتن عکس از یک وب‌سایت.
⦿ /paste ➠ آپلود یک قطعه متن به ابر و دادن لینک.
⦿ /tgm ➠ آپلود یک عکس (کمتر از 5MB) به ابر و دادن لینک.
⦿ /tr ➠ ترجمه متن.
⦿ /google ➠ جستجو برای اطلاعات در گوگل.
⦿ /stack ➠ جستجو برای اطلاعات مربوط به برنامه‌نویسی در استک اورفلو.
'''

    HELP_Image = '''تصویر

دستورات تصویر:

⦿ /draw ➠ ایجاد یک نقاشی بر اساس یک موضوع داده شده.
⦿ /image ➠ جستجو برای یک تصویر بر اساس یک کلمه کلیدی داده شده.
⦿ /upscale ➠ پاسخ به یک تصویر برای افزایش اندازه آن و بهبود کیفیت آن.
'''

    HELP_Action = '''اعمال

دستورات عملیاتی:

» دستورات موجود برای Ban و Mute:

 ❍ /kickme: کاربری که دستور را صادر کرده است را اخراج می‌کند.

فقط برای مدیران:
 ❍ /ban <نام‌کاربری>: یک کاربر را مسدود می‌کند. (توسط نام‌کاربری یا پاسخ به پیام)
 ❍ /sban <نام‌کاربری>: کاربر را به طور خاموش مسدود می‌کند. دستور، پیامی که پاسخ داده شده است و پاسخی نمی‌دهد را حذف می‌کند. (توسط نام‌کاربری یا پاسخ به پیام)
 ❍ /tban <نام‌کاربری> x(دقیقه/ساعت/روز): یک کاربر را به مدت x زمان مسدود می‌کند. (توسط نام‌کاربری یا پاسخ به پیام). m = دقیقه، h = ساعت، d = روز.
 ❍ /unban <نام‌کاربری>: کاربری که مسدود شده است را آزاد می‌کند. (توسط نام‌کاربری یا پاسخ به پیام)
 ❍ /kick <نام‌کاربری>: یک کاربر را از گروه اخراج می‌کند. (توسط نام‌کاربری یا پاسخ به پیام)
 ❍ /mute <نام‌کاربری>: یک کاربر را ساکت می‌کند. همچنین می‌توانید این دستور را به عنوان پاسخ به یک پیام استفاده کنید، کاربری که به آن پاسخ داده شده است را ساکت می‌کند.
 ❍ /tmute <نام‌کاربری> x(دقیقه/ساعت/روز): یک کاربر را به مدت x زمان ساکت می‌کند. (توسط نام‌کاربری یا پاسخ به پیام). m = دقیقه، h = ساعت، d = روز.
 ❍ /unmute <نام‌کاربری>: یک کاربر را از حالت ساکت خارج می‌کند. همچنین می‌توانید این دستور را به عنوان پاسخ به یک پیام استفاده کنید، کاربری که به آن پاسخ داده شده است را از حالت ساکت خارج می‌کند.
__
دستورات ویژه پشتیبانی از همه نمونه‌ها - Evo ban Evo mute Evo promote ..... etc
'''

    HELP_Search = '''جستجو

دستورات جستجو:

• /google <query> : جستجو برای کوئری داده شده در گوگل.
• /anime <query>  : جستجو برای کوئری داده شده در myanimelist.
• /stack <query>  : جستجو برای کوئری داده شده در استک اورفلو.
• /image (/imgs) <query> : دریافت تصاویر مربوط به کوئری شما

مثال:
/google پایتون: برگرداندن 5 نتیجه برتر.
'''

        HELP_Font = '''قلم

راهنمایی برای ماژول قلم:

ابزار فونت:

با استفاده از این ماژول می‌توانید فونت‌های هر متنی را تغییر دهید!

◌ /font [متن]
'''

    HELP_Game = '''بازی‌ها

راهنمایی برای بخش بازی‌ها:
دستورات بازی‌ها:

اینجا چند بازی کوچک برای شما برای بازی وجود دارد!

◌ /toss [پرتاب سکه]

◌ /roll [پرتاب تاس]

◌ /dart [پرتاب دارت]

◌ /slot [ماشین جک‌پات]

◌ /bowling [بازی بولینگ]

◌ /basket [بازی بسکتبال]

◌ /football [بازی فوتبال]
'''

    HELP_TG = '''Ⓣ-گراف

دستورات این قسمت Ⓣ-گراف:

ایجاد یک لینک تلگراف برای هر رسانه‌ای!

◌ /tgm [پاسخ به هر رسانه‌ای]
◌ /tgt [پاسخ به هر رسانه‌ای]
'''

    HELP_Imposter = '''تقلب‌گر

راهنمایی برای ابزار تقلب‌گر:

ابزارک تقلب‌گر:

◌ /imposter on
◌ /imposter off
'''

    HELP_TD = '''حقیقت-جرأت

راهنمایی برای قسمت حقیقت-جرأت:

حقیقت و جرأت
◌ /truth : ارسال یک رشته تصادفی حقیقت.
◌ /dare : ارسال یک رشته تصادفی جرأت.
'''
    HELP_HT = '''هشتگ

اینجا راهنمایی برای ابزار هشتگ است:

هشتگ
◌ /hastag : [متن]
'''
    HELP_TTS = '''متن به گفتار

اینجا راهنمایی برای ابزار تبدیل متن به گفتار است:

❀ متن به گفتار
◌ /tts : [متن]

◌ استفاده ➛ تبدیل متن به صوت
'''
    HELP_Fun = '''سرگرمی
اینجا راهنمایی برای بخش سرگرمی است:
بخش آرزو:

◌ /wish : افزودن آرزوی شما و دیدن امکاناتش!

موارد بیشتر:
◌ /sigma [بررسی سیگمانس]
◌ /cute [بررسی زیبایی]
◌ /horny [بررسی احساسات جنسی]
◌ /lesbo [بررسی درصد لزبینی]
◌ /depressed [بررسی افسردگی]
◌ /gay [بررسی گی]
◌ /rand [بررسی رندی]
◌ /bkl [بررسی بی‌کله‌بازی]
◌ /boobs [بررسی اندازه سینه]
◌ /dick [بررسی اندازه دیک]
'''
    HELP_Q = '''نقل قول
اینجا راهنمایی برای ماژول نقل قول است:

◌ /q : ایجاد نقل قول از پیام
◌ /q r : ایجاد نقل قول از پیام با پاسخ
'''
      
    fullpromote = {
    'can_change_info': True,
    'can_post_messages': True,
    'can_edit_messages': True,
    'can_delete_messages': True,
    'can_invite_users': True,
    'can_restrict_members': True,
    'can_pin_messages': True,
    'can_promote_members': True,
    'can_manage_chat': True,
}
    promoteuser = {
    'can_change_info': False,
    'can_post_messages': True,
    'can_edit_messages': True,
    'can_delete_messages': False,
    'can_invite_users': True,
    'can_restrict_members': False,
    'can_pin_messages': False,
    'can_promote_members': False,
    'can_manage_chat': True,
}
